#### terraform init `success`
#### terraform plan `success`

<details>
  <summary>Plan Result</summary>
  ```google_project_service.project["run.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/run.googleapis.com]
google_service_account.cloud-run-sa: Refreshing state... [id=projects/learn-terraform-322811/serviceAccounts/cloud-run-sa@learn-terraform-322811.iam.gserviceaccount.com]
google_compute_network.test-network: Refreshing state... [id=projects/learn-terraform-322811/global/networks/test-network]
google_project_service.project["compute.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/compute.googleapis.com]
google_project_service.project["containerregistry.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/containerregistry.googleapis.com]
google_project_service.project["iam.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/iam.googleapis.com]
google_project_service.project["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=learn-terraform-322811/cloudresourcemanager.googleapis.com]
google_compute_firewall.test-firewall: Refreshing state... [id=projects/learn-terraform-322811/global/firewalls/test-firewall]
google_compute_subnetwork.test-subnetwork1: Refreshing state... [id=projects/learn-terraform-322811/regions/asia-northeast1/subnetworks/test-subnetwork1]
google_project_iam_member.cloud-run-agent-iam: Refreshing state... [id=learn-terraform-322811/roles/run.serviceAgent/serviceAccount:cloud-run-sa@learn-terraform-322811.iam.gserviceaccount.com]
google_cloud_run_service.cloud-run-test: Refreshing state... [id=locations/asia-northeast1/namespaces/learn-terraform-322811/services/cloud-run-test]
google_compute_instance.test-server: Refreshing state... [id=projects/learn-terraform-322811/zones/asia-northeast1-b/instances/test-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_project_service.project["cloudresourcemanager.googleapis.com"] will be destroyed
  - resource "google_project_service" "project" {
      - disable_dependent_services = true -> null
      - disable_on_destroy         = true -> null
      - id                         = "learn-terraform-322811/cloudresourcemanager.googleapis.com" -> null
      - project                    = "learn-terraform-322811" -> null
      - service                    = "cloudresourcemanager.googleapis.com" -> null
    }

  # google_project_service.project["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "learn-terraform-322811"
      + service                    = "sqladmin.googleapis.com"
    }

  # google_sql_database_instance.cloud-sql-test will be created
  + resource "google_sql_database_instance" "cloud-sql-test" {
      + connection_name               = (known after apply)
      + database_version              = "MYSQL_8_0"
      + deletion_protection           = true
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "cloud-sql-test"
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "asia-northeast1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy           = (known after apply)
          + authorized_gae_applications = (known after apply)
          + availability_type           = (known after apply)
          + crash_safe_replication      = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = (known after apply)
          + disk_type                   = (known after apply)
          + pricing_plan                = "PER_USE"
          + replication_type            = (known after apply)
          + tier                        = "db-f1-micro"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = (known after apply)
              + enabled                        = (known after apply)
              + location                       = (known after apply)
              + point_in_time_recovery_enabled = (known after apply)
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + ip_configuration {
              + ipv4_enabled    = (known after apply)
              + private_network = (known after apply)
              + require_ssl     = (known after apply)

              + authorized_networks {
                  + expiration_time = (known after apply)
                  + name            = (known after apply)
                  + value           = (known after apply)
                }
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

